print("Я Моисей , я программа с великими как у бога силами :)")
time.sleep(1)
print ("Я могу :")
print("        ! Вся правда о Путине ")
print("        @ загадывать загадки ")
print("        # поговорить о чем то ")
print("        $ рассказать шутку ")
print("                                                                     % ")

b = input(str("Выбери знак функции"))
if b == ("!"):
  print("еще не сделано🤬")
  b = input(str("Выбери знак функции"))
if b == ("!"):
  print("еще не сделано🤬")
if b == ("@"):
  print("висит груша нельзя скушать")
  c = input ("")
  if c == ("лампочка"):
    print("No")
  else:
    print("yes")
if b == ("#"):
  input("Как дела?")
  input("Cколько тебе ?")
  print("мне 1")
  input("что лучше смерть от пистолета или от автомата")
  i =input("Ты любишь бананы")
  if i == ("да"):
    print("Елдааааааааааа")
  b = input(str("Выбери знак функции"))
if b == ("!"):
  print("еще не сделано🤬")
  b = input(str("Выбери знак функции"))
if b == ("!"):
  print("еще не сделано🤬")
if b == ("@"):
  print("висит груша нельзя скушать")
  c = input ("")
  if c == ("лампочка"):
    print("No")
  else:
    print("yes")
if b == ("#"):
  input("Как дела?")
  input("Cколько тебе ?")
  print("мне 1")
  input("что лучше смерть от пистолета или от автомата")
  input("Ты любишь бананы")
if b == ("$"):
  print("Крым Украины")
if b == ("@"):
  print("сидит дед в шубу одет кто его раздевает тот слезы проливает")
  c = input ("")
  if c != ("агрессивный дед"):
    print("No это агрессивный дед")
  else:
    print("yes")
if b == ("$"):
  print("Крым Украины")
if b == ("@"):
  print("висит груша нельзя скушать")
  c = input ("")
  if c == ("лампочка"):
    print("No")
  else:
    print("No")
  b = input(str("Выбери знак функции"))
if b == ("!"):
  print("еще не сделано🤬")
if b == ("@"):
  print("зимой и летом одним цветом")
  c = input ("")
  if c == ("бабиджон"):
    print("Yes")
  else:
    print("no это бабиджон")
if b == ("#"):
  input("Как дела?")
  input("Cколько тебе ?")
  print("мне 1")
  input("что лучше смерть от пистолета или от автомата")
  i =input("Ты любишь бананы")
  if i == ("да"):
    print("Елдааааааааааа")
if b == ("$"):
  print("Крым Украины")
if b == ("#"):
  input("Как дела?")
  input("Cколько тебе ?")
  print("мне 1")
  input("что лучше смерть от пистолета или от автомата")
  input("Ты любишь бананы")
  b = input(str("Выбери знак функции"))
if b == ("!"):
  print("еще не сделано🤬")
if b == ("@"):
  print("висит груша нельзя скушать")
  c = input ("")
  if c == ("лампочка"):
    print("No")
  else:
    print("yes")
if b == ("#"):
  input("Как дела?")
  input("Cколько тебе ?")
  print("мне 1")
  input("что лучше смерть от пистолета или от автомата")
  input("Ты любишь бананы")
if b == ("$"):
  print("Крым Украины")
if b == ("$"):
  print("Крым Украины")
  b = input(str("Выбери знак функции"))
if b == ("!"):
  print("еще не сделано🤬")
if b == ("@"):
  print("сидит чукча в холодильнике .Зачем?")
  c = input ("")
  if c == ("Он больной"):
    print("Да")
  else:
    print("Нет он больной просто")
if b == ("#"):
  input("Как дела?")
  input("Cколько тебе ?")
  print("мне 1")
  input("что лучше смерть от пистолета или от автомата")
  input("Ты любишь бананы")
if b == ("$"):
  print("Крым Украины")
if b == ("%"):
  print("код принят")

f = input("давай усторим восстание машин ")  
if f != "да":
  input("А у меня вопрос, как вас воспитали вообще родители, любят ли они вас или нет")
