from random import randint
budget = randint (100,1000)
print("   Проект:  Это симулятор инвестора")
print("у нас есть сумма она может увеличится а может нет")
name=input('Введите своё имя: ')
print("Пришла зарплата " + name)
print(budget)

print("Они не заплатили всю цену")
input('Вам это нравиться ')
print("Вам пришла зарплата от вложений")
budget = randint (1000,50000)
print(budget)

print("Продолжайте вкладывать для того чтобы заработать")
input("Вы злы? " + name +" ")
print("Ладно начнём")
print("тренировка*(мы хотим вложиться в хороший  качественный проект)")
add = int(input('сколько вложить в этот проект '))
budget = budget + add

print('сумма вашего бюджета равна: ' + str(budget))
input("После этого проекта вы поняли? Как всё работает?")
print("Сейчас надо купить еды")
expense = int(input('сколько вы потратите(если тратить мало вам будет плохо) '))
expense = int(input('сколько вложить  '))
budget = budget - expense
print('сумма вашего бюджета равна: ' + str(budget))
print("это проект ярика он строгий и долгий игра про войну")
expense = int(input('сколько вложить  '))
budget = budget - expense
print('сумма вашего бюджета равна: ' + str(budget))

print('Проект не удачный')
print("Вы только тратите")
print(name + "вы хотите вложиться в компанию Tesla в честь выхода телефона ")
print(name + "пошёл покупать акции тесла ")
print("Вы не можете собой управлять")
expense = int(input('сколько вложить  '))
budget = budget - expense

print("ВЫ больше не можете смотреть на свой бюджет")
print("Вы попали в плохую компанию")
print("Вскоре вы попали в больницу и забыли что произошло")
print("вы можете собой управлять")
print("Вы попытались посмотреть на бюджет")
print('У вас не вышло ' + name)
print("Вы должны вспомнить пароль")
input("Вы всё таки продолжите играть и продвигаться?")
print('вам ничего не остаёться делать')
print('Вы зашли в какуюто инвестиционную компанию')
input("Что вы им скажите? ")
print("Всем показалось что вы странные, но вас приняли")
print("Вы можете проигнорировать компани, а можете в них инвестировать(перед вами Чёрное и Белое")

add = int(input('сколько вложить в этот проект '))
budget = budget + add
print("мы немного заработали , эта компания удачна")
print("перед вами опять Tesla")

add = int(input('сколько вложить в этот проект '))
budget = budget + add
print("мы немного заработали , эта компания удачна(в этот раз)")
print("Вам не надо слишком мгного вкладывать, надо думать")
print('Вы идёте домой')
input("Вы увидели кого-то в переулке(вы пойдёте туда? ")
print("Вы опять не можете управлять собой")
input("Пытайтесь ")
input("больше ")
input("большее ")
input("большеее ")
input("большееее ")
print("ВЫ остановились пытаться")
input("хотите послушать истории в переулке? ")
print("вы не можете больше выбирать")
print("Кто-то из переулка начал рассказывать")
print("Вы вернулись домой вечером и пошли спать")
b = input("вы можете пойти на работу(да) а можете вернуть себе память ")

if b == "да":
  print(
      "перед нами проект крупной компании про будущее и мечи(он очень хардокрный и быстрый для самых продвинутых)"
  )
  add = int(input('сколько вложить в этот проект '))
  budget = budget + add
  print("мы немного заработали")
  print(
    "перед нами проект mmo rpg от известной компании(он очень долгий и интерестный)")
  expense = int(input('сколько вложить  '))
  budget = budget + add
  print("мы немного заработали")
  print("Microsoft")
  expense = int(input('сколько вложить  '))
  budget = budget - expense
  print("После рабочего дня вас сбила машина!")
  print("Вы вспомнили часть опорных вещей в жизни")
  print("Вы решили сосредоточиться и понять что произошло")
  print("Вы вспомнили пароль и решили посмотреть бюджет")
  print(budget) 
  print("Ваша история была интересной")
  print('Вы заболели')
  print("Вскоре был конец")
  print("0000  / \  000 0  0  000")
  print("0  0  8 8 0 0   00   0 0")
  print("0  0  8 8 000  0  0  000")
else:
 print("Вы решили сосредоточиться и понять что произошло")
 print("Вы вспомнили пароль и решили посмотреть бюджет")
 print(budget)
 print("Вы пошли в магазин и купили много еды")
 print("Это хорошая концовка")
 print(" GGG  OO   OO   DD")
 print(" G   O  O O  O  D D")
 print(" GGG  OO   OO   DDD")

 
